//
//  Text2.swift
//  Project_Tadak
//
//  Created by Min_MacbookPro on 2020/08/16.
//  Copyright © 2020 Tadak_Team. All rights reserved.
//

import Foundation

class Text2 {
    var title1: String = "애국가"
    var textArray1 =
        [
            "동해물과 백두산이 마르고 닳도록",
            "하느님이 보우하사 우리나라 만세",
            "무궁화 삼천리 화려강산",
            "대한사람 대한으로 길이 보전하세",
            "남산위에 저 소나무 철갑을 두른듯",
            "바람서리 불변함은 우리 기상일세"
        ]
    var title2: String = "다시 여기 바닷가"
    var textArray2 =
        [
            "예아! 호우! 예예예~",
            "싹쓰리 인더 하우스",
            "커커커커커몬! 싹!쓰리!투 렛츠고!",

            "나 다시 또 설레어",
            "이렇게 너를 만나서",
            "함께 하고 있는 지금 이 공기가",

            "다시는 널 볼 순 없을 거라고",
            "추억일 뿐이라",
            "서랍 속에 꼭 넣어뒀는데",

            "흐르는 시간 속에서",
            "너와 내 기억은",
            "점점 희미해져만 가",
            "끝난 줄 알았어",

            "지난여름 바닷가",
            "너와 나 단둘이",
            "파도에 취해서 노래하며",
            "같은 꿈을 꾸었지",
            "다시 여기 바닷가",
            "이제는 말하고 싶어",
            "네가 있었기에 내가 더욱 빛나",
            "별이 되었다고",

            "다들 덥다고 막 짜증내",
            "괜찮아 우리 둘은 따뜻해",
            "내게 퐁당 빠져버린 널",
            "이젠 구하러 가지 않을 거야",
            "모래 위 펴펴펴편지를 써",
            "밀물이 밀려와도 못 지워",
            "추억이 될 뻔한 첫 느낌",
            "너랑 다시 한번 받아 보고 싶어",

            "흐르는 시간 속에서",
            "너와 내 기억은",
            "점점 희미해져만 가",
            "끝난 줄 알았어",

            "지난여름 바닷가",
            "너와 나 단둘이",
            "파도에 취해서 노래하며",
            "같은 꿈을 꾸었지",
            "다시 여기 바닷가",
            "이제는 말하고 싶어",
            "네가 있었기에 내가 더욱 빛나",
            "별이 되었다고",

            "시간의 강을 건너",
            "또 맞닿은 너와 나",
            "소중한 사랑을 영원히",
            "간직해줘",

            "지난여름 바닷가",
            "너와 나 단둘이",
            "파도에 취해서 노래하며",
            "같은 꿈을 꾸었지",
            "다시 여기 바닷가",
            "이제는 말하고 싶어",
            "네가 있었기에 내가 더욱 빛나",
            "별이 되었다고"
        ]
    var title3: String = "아무노래"
    var textArray3 =
        [
            "왜들 그리 다운돼있어?",

            "뭐가 문제야 say something",

            "분위기가 겁나 싸해",

            "요새는 이런 게 유행인가",

            "왜들 그리 재미없어?",

            "아 그건 나도 마찬가지",

            "Tell me what I got to do",

            "급한 대로 블루투스 켜",



            "아무 노래나 일단 틀어",

            "아무거나 신나는 걸로",

            "아무렇게나 춤춰",

            "아무렇지 않아 보이게",

            "아무 생각 하기 싫어",

            "아무개로 살래 잠시",

            "I’m sick and tired of my everyday",

            "Keep it up 한 곡 더",



            "아무 노래나 일단 틀어",

            "아무렴 어때 It’s so boring",

            "아무래도 refresh가 시급한 듯해 쌓여가 스트레스가",

            "배꼽 빠질 만큼만 폭소하고 싶은 날이야",

            "What up my dawgs 어디야 너희",

            "올 때 병맥주랑 까까 몇 개 사 와 huh",



            "클럽은 구미가 잘 안 당겨",

            "우리 집 거실로 빨랑 모여",

            "외부인은 요령껏 차단 시켜",

            "밤새 수다 떨 시간도 모자라",

            "누군 힘들어 죽겠고 누군 축제",

            "괜히 싱숭생숭 I want my youth back",

            "좀 전까지 왁자지껄",

            "하다 한 명 두 명씩 자릴 떠",



            "왜들 그리 다운돼있어?",

            "뭐가 문제야 say something",

            "분위기가 겁나 싸해",

            "요새는 이런 게 유행인가",

            "왜들 그리 재미없어?",

            "아 그건 나도 마찬가지",

            "Tell me what I got to do",

            "급한 대로 블루투스 켜",



            "아무 노래나 일단 틀어",

            "아무거나 신나는 걸로",

            "아무렇게나 춤춰",

            "아무렇지 않아 보이게",

            "아무 생각 하기 싫어",

            "아무개로 살래 잠시",

            "I’m sick and tired of my everyday",

            "Keep it up 한 곡 더",



            "떠나질 못할 바엔",

            "창밖은 쳐다도 안 봐",

            "회까닥해서 추태를 부려도",

            "No worries at all",

            "이미지 왜 챙겨 그래 봤자 우리끼린데",



            "Ohh 늦기 전에 막판 스퍼트",

            "20대가 얼마 안 남았어",

            "편한 옷으로 갈아입어",

            "You look nice",
            "get’em high",

            "얼핏 보면 그냥 코미디",

            "이렇게 무해한 파티 처음이지?",

            "만감이 교차하는 새벽 2시경",

            "술잔과 감정이 소용돌이쳐",



            "왜들 그리 다운돼있어?",

            "뭐가 문제야 say something",

            "분위기가 겁나 싸해",

            "요새는 이런 게 유행인가",

            "왜들 그리 재미없어?",

            "아 그건 나도 마찬가지",

            "Tell me what I got to do",

            "급한 대로 블루투스 켜",



            "아무 노래나 일단 틀어",

            "아무거나 신나는 걸로",

            "아무렇게나 춤춰",

            "아무렇지 않아 보이게",

            "아무 생각 하기 싫어",

            "아무개로 살래 잠시",

            "I’m sick and tired of my everyday",

            "Keep it up 한 곡 더",

            "아무 노래나 일단",



            "아무 노래 아무 노래 아무 노래나 틀어봐",

            "아무 노래 아무 노래 아무 노래나 틀어봐",

            "아무 노래 아무 노래 아무 노래나 틀어봐",

            "아무 노래 아무 노래 아무 노래나 KOZ"
        ]
    func getTitle(num: Int) -> String
    {
        switch num {
        case 1:
            return title1
        case 2:
            return title2
        case 3:
            return title3
        default:
            return title1
        }
    }
    func getData(num: Int) -> Array<String>
    {
        switch num {
        case 1:
            return textArray1
        case 2:
            return textArray2
        case 3:
            return textArray3
        default:
            return textArray1
        }
    }
}
